awscli
bat
bison
ccache
cmake
cocoapods
container
doxygen
fastlane
fd
ffmpeg
flex
fzf
gh
git
graphviz
htop
jq
kubernetes-cli
libomp
make
neofetch
neovim
node
nvm
ollama
open-scene-graph
openjdk
perl
pipx
postgresql@17
powerlevel10k
pyenv
qt@5
r
redis
starship
stow
tmux
walk
watchman
zoxide
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
