bat
eza
fd
fzf
gh
git
htop
jq
make
neovim
node
nvm
ollama
opencode
pyenv
ripgrep
starship
stow
tmux
uv
zoxide
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
