tap "anomalyco/tap"
tap "krishkrosh/apps"
tap "romkatv/powerlevel10k"
tap "stripe/stripe-cli"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "bison"
brew "ccache"
brew "cocoapods"
brew "container"
brew "doxygen"
brew "fastlane"
brew "fd"
brew "ffmpeg"
brew "flex"
brew "fzf"
brew "gh"
brew "git"
brew "graphviz"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "libomp"
brew "make"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "node"
brew "nvm"
brew "ollama"
brew "open-scene-graph"
brew "openjdk"
brew "perl"
brew "pipx"
brew "pkgconf"
brew "postgresql@17"
brew "powerlevel10k"
brew "pyenv"
brew "qt@5"
brew "r"
brew "redis"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "walk"
brew "watchman"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "stripe/stripe-cli/stripe"
cask "android-studio"
cask "bartender"
cask "codex"
cask "container"
cask "docker-desktop"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "inkscape"
cask "iterm2"
cask "mactex"
cask "ngrok"
cask "orbstack"
cask "postman"
cask "r-app"
cask "rstudio"
cask "stats"
cask "krishkrosh/apps/trackweight"
cask "visual-studio-code"
cask "warp"
cask "zulu@17"
vscode "akamud.vscode-theme-onedark"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "azemoh.one-monokai"
vscode "bierner.markdown-mermaid"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eliverlara.andromeda"
vscode "emroussel.atomize-atom-one-dark-theme"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "felipe-mendes.slack-theme"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "heron.firefox-devtools-theme"
vscode "james-yu.latex-workshop"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "oezeb.markdown-to-pdf"
vscode "pkief.material-icon-theme"
vscode "purocean.drawio-preview"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rocketseat.theme-omni"
vscode "rokoroku.vscode-theme-darcula"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "shahilkumar.docxreader"
vscode "simonsiefke.svg-preview"
vscode "slevesque.shader"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "tobiasalthoff.atom-material-theme"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "tyriar.luna-paint"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "whizkydee.material-palenight-theme"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
