tap "anomalyco/tap"

# Core CLI
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "make"
brew "ripgrep"
brew "tmux"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Python / AI engineering
brew "pyenv"
brew "uv"
brew "node"
brew "nvm"
brew "ollama"
brew "opencode"

# Editors and terminal
brew "neovim"
brew "starship"
brew "stow"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "orbstack"
cask "visual-studio-code"
