anthropic.claude-code
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.github-vscode-theme
mechatroner.rainbow-csv
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
pkief.material-icon-theme
redhat.vscode-yaml
saoudrizwan.claude-dev
tamasfe.even-better-toml
