akamud.vscode-theme-onedark
anthropic.claude-code
apollographql.vscode-apollo
azemoh.one-monokai
bierner.markdown-mermaid
catppuccin.catppuccin-vsc
christian-kohler.npm-intellisense
daltonmenezes.aura-theme
dbaeumer.vscode-eslint
docker.docker
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
eliverlara.andromeda
emroussel.atomize-atom-one-dark-theme
enkia.tokyo-night
esbenp.prettier-vscode
felipe-mendes.slack-theme
firefox-devtools.vscode-firefox-debug
github.github-vscode-theme
grapecity.gc-excelviewer
hediet.vscode-drawio
heron.firefox-devtools-theme
mechatroner.rainbow-csv
modular-mojotools.vscode-mojo
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
oezeb.markdown-to-pdf
pkief.material-icon-theme
purocean.drawio-preview
redhat.vscode-yaml
ritwickdey.liveserver
rocketseat.theme-omni
rokoroku.vscode-theme-darcula
saoudrizwan.claude-dev
sdras.night-owl
shahilkumar.docxreader
simonsiefke.svg-preview
slevesque.shader
stylelint.vscode-stylelint
tamasfe.even-better-toml
tobiasalthoff.atom-material-theme
tomoki1207.pdf
twxs.cmake
tyriar.luna-paint
vadimcn.vscode-lldb
vscjava.vscode-gradle
whizkydee.material-palenight-theme
yzane.markdown-pdf
zhuangtongfa.material-theme
